challenges/phase-11/online-review-site/metro-review-site/app/controllers/admin/stations_controller.rb

  def destroy
    @station = Station.find(params[:id])
    @station.destroy
---
SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "stations" WHERE "stations"."id" = $1  [["id", 3]]