challenges/phase-11/online-review-site/metro-review-site/app/controllers/admin/users_controller.rb

  def destroy
    @users = User.all
    @user = User.find(params[:id])
    @user.destroy
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]