challenges/phase-11/online-review-site/metro-review-site/app/controllers/home_controller.rb

  def index
    @stations = Station.all
---
SELECT "stations".* FROM "stations"