challenges/phase-11/online-review-site/metro-review-site/app/controllers/stations_controller.rb

  def create

    @station = Station.new(station_params)

    if @station.save
---
INSERT INTO "stations" ("name", "line", "state", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Benning Road"], ["line", "Blue"], ["state", "DC"], ["description", "A nice little station!"], ["created_at", 2016-10-20 17:57:27 UTC], ["updated_at", 2016-10-20 17:57:27 UTC]]

  def show
    @station = Station.find(params[:id])
---
SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @station = Station.find(params[:id])
---
SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @station = Station.find(params[:id])

    if @station.update(station_params)
---
SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "stations" SET "parking" = $1, "updated_at" = $2 WHERE "stations"."id" = $3  [["parking", true], ["updated_at", 2016-10-20 18:56:27 UTC], ["id", 1]]